v2206/atmospheric_AloisLuggerPlatz/run0/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3 0 0);

boundaryField
{
    inlet
    {
        type                    fixedProfile;
        profile                 csvFile; // table;
        profileCoeffs
        {
            file                "0/uInletProfile.csv";
            format              csv;
            nHeaderLine         1;
            refColumn           3;
            componentColumns    (2 1 0);
            separator           ",";
            mergeSeparators     no;
            outOfBounds         clamp;
            interpolationScheme linear;
        }
        direction               (0 1 0);
        origin                  0;
    }

    outlet
    {
        type            zeroGradient;
    }

    upperAtm
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform (3.53 0 0); // <-- for 100m height
        // inletValue      uniform (2.3 0 0);  // <-- for 10m height

        // type            zeroGradient;
    }

    "(ground|ground_platz|ground_streets)"
    {
        type            noSlip;
    }

    frontAtm
    {
        // type            cyclic;
        type            zeroGradient;
    }

    backAtm
    {
        // type            cyclic;
        type            zeroGradient;
    }

    buildings
    {
        type            noSlip;
    }

    "(walls_top|walls_ground|walls_east|walls_west|walls_north|walls_south)"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
